Agat/src/Catalogs/ДокументыДоверенности/ДокументыДоверенности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыДоверенности</name>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнители</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыДокументаПодтверждающегоИсполнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Н</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КнопкаДействие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КнопкаУдалить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПодрядчиком</name>
    <type>
      <types>CatalogRef.ДоговораСубподряда</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящиеДокументы</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящиеДокументы</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряженияГД</name>
    <type>
      <types>CatalogRef.РаспоряженияГД</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряженияТД</name>
    <type>
      <types>CatalogRef.РаспоряженияТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставИсполнителей</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/ДокументыДоверенности/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Загрузка файлов    //////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общие модули:                                                              //
//   			РаботаСФайламиСервер:                                         //
//										Процедура ПриСозданииНаСервере 		  //
//              РаботаСФайламиКлиент:                                         //
//                                      Асинх Процедура КомандаДействие       //
//                                      Асинх Процедура КомандаУдалить        //
// Константы:                                                                 //
//              ПутьХранилищаФайлов:                                          //
//                                      Адрес файлового хранилища заданного   //
//                                      пользователем (Администратор)         //
// Реквизиты ТЧ:                                                              //
// 				РасширениеФайла - строка                                      //
//				УникальныйИдентификатор - УникальныйИдентификатор             // 
//                                      Присвоение имени файла в архиве HDD   //
// Реквизиты формы:                                                           //
//          	ПутьХранилища - строка                                        //
//                                      Хранение данных Константы:            //
//										ПутьХранилищаФайлов                   //
// Команды:                                                                   //
//          	КомандаДействие - Асинх Процедура КомандаДействие(Команда)    //
//                                (Присоединение / просомтр файла)			  //
//                                 Тригер - Реквизит ТЧ - РасширениеФайла     //
//          	КомандаУдалить  - Асинх Процедура КомандаУдалить(Команда)     //
// События:                                                                   //
//    	Форма:                                                                //
//				Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   //
//      	    Процедура ПриОткрытии(Отказ)             					  //
//      	    Процедура ПослеЗаписи(ПараметрыЗаписи)           			  //
//      	    Процедура ОбновитьКнопкиФайлов()   							  // 
//                                                                            //
// Особенности:                                                               //
//              Присвооение имени выгруженного файла по шаболну:              //
//              РаботаСФайламиКлиент - Функция СформироватьИмяФайлаИзДанных   // 
// шаболн:                                                                    //
//       "%1_№ %2_от %3%4", Назв, Ном, Дат, ТекущиеДанные.РасширениеФайла);	  //
////////////////////////////////////////////////////////////////////////////////

// =============================================================================
// СИСТЕМНЫЕ СОБЫТИЯ ФОРМЫ
// =============================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Для формы элемента без ТЧ условное оформление таблиц не требуется.
	// Метод НастроитьОформлениеВсехТаблиц здесь не нужен и может вызвать ошибку.
	
	// 2. Устанавливаем доступность кнопок при открытии карточки.
	// В справочнике без ТЧ префикс (имя ТЧ) передаем пустой "".
	ОбновитьДоступностьКнопокНаСервере();
	
											/////////////////////////////////////////////////////////////////////////////////
											// Множественный выбор Сотрудников  // использование стандартной формы ввода
											/////////////////////////////////////////////////////////////////////////////////

											//////////////////////////////////////////////////////////////////////////////// 
											////////////////////////////////////////////////////////////////////////////////
											ОбновитьВыпадающийСписокНаСервере();
			                                // 1. Наполняем список (как делали ранее)
										    ОбновитьВыпадающийСписокНаСервере();
										    
										    // 2. Убираем системные кнопки "+" и "Показать все" программно
										    Поле = Элементы.ОтветственныйИсполнитель;
										    Поле.РежимВыбораИзСписка = Истина;
										    
										    // Отключаем кнопки создания и расширенного выбора
										    Поле.КнопкаСоздания = Ложь;
										    Поле.КнопкаСпискаВыбора = Истина; // Оставляем только стрелочку вниз
										    
										    // Чтобы список не был шире самого поля
										    Поле.Ширина = 16; 
										    Поле.РастягиватьПоГоризонтали = Ложь;
                                            ////////////////////////////////////////////////////////////////////////////////
											////////////////////////////////////////////////////////////////////////////////

	// Формируем массив всех табличных частей, которые поддерживают работу с файлами
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("Приложения");
	
	// Настраиваем программное условное оформление для отображения иконок (лупа/скрепка) 
	// в колонках ИмяТЧ+"Действие" и ИмяТЧ+"Удалить"
	РаботаСФайламиСервер.НастроитьОформлениеВсехТаблиц(ЭтаФорма, МассивТЧ);
	
	
											
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьКнопокНаСервере()
	
	ЕстьФайл = ЗначениеЗаполнено(Объект.РасширениеФайла);
	
	// Если ваши кнопки называются просто "КомандаУдалить" и "КомандаДействие"
	Попытка
		Элементы.КомандаУдалить.Доступность = ЕстьФайл;
		// Кнопка прикрепления/открытия обычно доступна всегда
		Элементы.КомандаДействие.Доступность = Истина; 
	Исключение
		// Имена элементов на форме не совпали с именами в коде
	КонецПопытки;
	
КонецПроцедуры

// =============================================================================
// УНИВЕРСАЛЬНЫЕ КОМАНДЫ 
// =============================================================================

&НаКлиенте
Асинх Процедура КомандаДействие(Команда)
	
	// 1. ОПРЕДЕЛЯЕМ КОНТЕКСТ (таблица или шапка)
	ТекущийЭлемент = ЭтаФорма.ТекущийЭлемент;
	ТипТекущегоЭлемента = ТипЗнч(ТекущийЭлемент);
	
	// Проверяем, находимся ли мы в табличной части
	ЭтоТаблица = (ТипТекущегоЭлемента = Тип("ТаблицаФормы"));
	
	// 2. ЛОГИКА ДЛЯ ТАБЛИЦЫ
	Если ЭтоТаблица Тогда
		ИмяТаблицы = ТекущийЭлемент.Имя;
		
		Если Объект[ИмяТаблицы].Количество() = 0 Тогда
			ПоказатьОповещениеПользователя("Внимание", , "Таблица пуста!");
			Возврат;
		КонецЕсли;
		
		Если ТекущийЭлемент.ТекущиеДанные = Неопределено Тогда
			ТекущийЭлемент.ТекущаяСтрока = Объект[ИмяТаблицы].ПолучитьИдентификатор();
		КонецЕсли;
		
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		
	// 3. ЛОГИКА ДЛЯ ШАПКИ (вне таблицы)
	// Работает как при наличии файла, так и при его отсутствии
	Иначе
		ТекущиеДанные = Объект;
		ИмяТаблицы = ""; // Пустая строка показывает, что это шапка
	КонецЕсли;
	
	// 4. ВЫПОЛНЕНИЕ
	Попытка
		Ждать РаботаСФайламиКлиент.ВыполнитьДействиеСФайлом(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
	КонецПопытки;
	
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаУдалить(Команда)
	
	ТекущийЭлемент = ЭтаФорма.ТекущийЭлемент;
	ТипТекущегоЭлемента = ТипЗнч(ТекущийЭлемент);
	ЭтоТаблица = (ТипТекущегоЭлемента = Тип("ТаблицаФормы"));
	
	// 1. ЛОГИКА ДЛЯ ТАБЛИЦЫ
	Если ЭтоТаблица Тогда
		ИмяТаблицы = ТекущийЭлемент.Имя;
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат; 
		КонецЕсли;
		
	// 2. ЛОГИКА ДЛЯ ШАПКИ (вне таблицы)
	Иначе
		// Если файла нет - нечего удалять
		Если НЕ ЗначениеЗаполнено(Объект.РасширениеФайла) Тогда 
			ПоказатьОповещениеПользователя("Внимание", , "Нет загруженного файла");
			Возврат; 
		КонецЕсли;
		
		ТекущиеДанные = Объект;
		ИмяТаблицы = "";
	КонецЕсли;
//////////////////////////////////////////////////////////////////////////	
	// 3. ПОЛУЧЕНИЕ ПАРАМЕТРОВ справочника для передачи в регистр свдений РегистрУдаленияФайлов
	ДанныеСправочника = ПолучитьДанныеСправочникаНаСервере(Объект.Ссылка);
	
	ИмяСправочника = ДанныеСправочника.ИмяСправочника;
	НаименованиеЭлемента = ДанныеСправочника.Наименование;
	СсылкаНаОбъект = ДанныеСправочника.Ссылка;
	
	ИмяПользователя = "Система";
	Если ЗначениеЗаполнено(Объект.ОтветственныйИсполнитель) Тогда
		ИмяПользователя = ПолучитьИмяСотрудникаНаСервере(Объект.ОтветственныйИсполнитель);
	КонецЕсли;
//////////////////////////////////////////////////////////////////////////	
	// 4. УДАЛЕНИЕ
	Попытка
		// Удаляем файл через общий модуль РаботаСФайламиКлиент
		Ждать РаботаСФайламиКлиент.УдалитьФайл(
				ЭтаФорма, 
				ТекущиеДанные, 
				ИмяТаблицы, 
				ИмяСправочника,
				НаименованиеЭлемента,
				СсылкаНаОбъект,
				ИмяПользователя
		);
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
	КонецПопытки;
	
	// ОБНОВЛЕНИЕ состояние кнопок (сделает "Удалить" недоступной)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	//  Обновить
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

	////////////////////////////////////////////////////////////////////////////////
    // Полуычение данных на сервере для КомандаУдалить 
	// для передачи в регистр сведений - РегистрУдаленияФайлов
	////////////////////////////////////////////////////////////////////////////////
	
	&НаСервере
	Функция ПолучитьДанныеСправочникаНаСервере(СсылкаНаОбъект)
		
		Результат = Новый Структура;
		Результат.Вставить("ИмяСправочника", "");
		Результат.Вставить("Наименование", "");
		Результат.Вставить("Ссылка", "");
		
		Если СсылкаНаОбъект = Неопределено Или СсылкаНаОбъект.Пустая() Тогда
			Возврат Результат;
		КонецЕсли;
		
		Попытка
			// На сервере Метаданные() доступны
			МетаОбъекта = СсылкаНаОбъект.Метаданные();
			Результат.ИмяСправочника = МетаОбъекта.Синоним;
			Результат.Наименование = СсылкаНаОбъект.Наименование;
			Результат.Ссылка = Строка(СсылкаНаОбъект);
		Исключение
			// Если ошибка, заполняем как можем
			Результат.ИмяСправочника = "ВнутренниеДокументы-";
			Результат.Наименование = СсылкаНаОбъект.Наименование;
			Результат.Ссылка = Строка(СсылкаНаОбъект);
		КонецПопытки;
		
		Возврат Результат;
		
	КонецФункции
	
	&НаСервере
	Функция ПолучитьИмяСотрудникаНаСервере(СсылкаНаСотрудника)
		
		Если СсылкаНаСотрудника = Неопределено Или СсылкаНаСотрудника.Пустая() Тогда
			Возврат "Система";
		КонецЕсли;
		
		Попытка
			Возврат СсылкаНаСотрудника.Наименование;
		Исключение
			Возврат "Система";
		КонецПопытки;
		
	КонецФункции
	
     ////////////////////////////////////////////////////////////////////////////////

// =============================================================================
// ОБРАБОТЧИКИ АКТИВИЗАЦИИ СТРОК (Обновление кнопок при перемещении курсора)
// =============================================================================

&НаКлиенте
Процедура ПриложенияПриАктивизацииСтроки(Элемент)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Элемент.ТекущиеДанные, "Приложения"); 
КонецПроцедуры
	 
	 
// =============================================================================
// ОБНОВЛЕНИЕ ИНТЕРФЕЙСА (Для формы элемента без табличных частей)
// =============================================================================

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Обновляем кнопки при открытии карточки
	ОбновитьКнопкиФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Обновляем кнопки после сохранения данных
	ОбновитьКнопкиФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопкиФайлов()
	// Вместо "ВнутренниеДокументы" передаем пустую строку в качестве ТЧ, 
	// так как работаем напрямую с Объектом.
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Объект, ""); 
	
	// Принудительная перерисовка
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////




/////////////////////////////////////////////////////////////////////////////////
// Множественный выбор Сотрудников  // использование стандартной формы ввода
/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ИсполнителиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    // 1. Отменяем стандартное окно справочника
    СтандартнаяОбработка = Ложь;
    
    // 2. Получаем список сотрудников с сервера
    СписокСотрудников = ПолучитьСписокСотрудниковНаСервере();
    
    // 3. Подготавливаем оповещение
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияОкнаОтметки", ЭтотОбъект, СписокСотрудников);
    
    // 4. ВЫЗОВ СИСТЕМНОГО ОКНА С ГАЛОЧКАМИ
    // Оно откроется в отдельном мини-окне у элемента
    СписокСотрудников.ПоказатьОтметкуЭлементов(Оповещение, "Исполнители");
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаОтметки(Результат, СписокСотрудников) Экспорт
    
    // Если пользователь нажал "Отмена" или закрыл крестиком
    Если Результат = Неопределено Тогда 
        Возврат; 
    КонецЕсли;
    
    // Результат — это тот же СписокСотрудников, но с измененными пометками
    МассивСсылок = Новый Массив;
    Для Каждого ЭлементСписка Из Результат Цикл
        Если ЭлементСписка.Пометка Тогда
            МассивСсылок.Добавить(ЭлементСписка.Значение);
        КонецЕсли;
    КонецЦикла;
    
    // Сохраняем результат
    ОбновитьИсполнителейНаСервере(МассивСсылок);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСотрудниковНаСервере()
    
    Список = Новый СписокЗначений;
    
    // Получаем сотрудников через быстрый запрос
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Сотрудники.Ссылка КАК Ссылка,
        |	Сотрудники.Наименование КАК Наименование
        |ИЗ
        |	Справочник.Сотрудники КАК Сотрудники
        |ГДЕ
        |	НЕ Сотрудники.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО
        |	Наименование";
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        НовыйЭл = Список.Добавить(Выборка.Ссылка, Выборка.Наименование);
        
        // Сразу ставим галочки тем, кто уже сохранен в ТЧ "СоставИсполнителей"
        Отбор = Новый Структура("Исполнитель", Выборка.Ссылка);
        Если Объект.СоставИсполнителей.НайтиСтроки(Отбор).Количество() > 0 Тогда
            НовыйЭл.Пометка = Истина;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Список;
    
КонецФункции

&НаСервере
Процедура ОбновитьИсполнителейНаСервере(МассивСсылок)
    
    // Синхронизируем ТЧ
    Объект.СоставИсполнителей.Очистить();
    СписокИмен = Новый СписокЗначений;
    
    Для Каждого Ссылка Из МассивСсылок Цикл
        НоваяСтр = Объект.СоставИсполнителей.Добавить();
        НоваяСтр.Исполнитель = Ссылка;
        СписокИмен.Добавить(Строка(Ссылка));
    КонецЦикла;
    
    // Сортируем ФИО для красивого вывода в поле через запятую
    СписокИмен.СортироватьПоПредставлению();
    
    МассивЧистыхИмен = Новый Массив;
    Для Каждого Эл Из СписокИмен Цикл
        МассивЧистыхИмен.Добавить(Эл.Значение);
    КонецЦикла;
    
    Объект.Исполнители = СтрСоединить(МассивЧистыхИмен, ", ");
    
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
//ОтветвенныйИсполнитель - одиночный выбор из выпадающего меню  (без кнопок)
////////////////////////////////////////////////////////////////////////////////


&НаСервере
Процедура ОбновитьВыпадающийСписокНаСервере()
	
	// Получаем элемент формы
	ПолеСписка = Элементы.ОтветственныйИсполнитель;
	ПолеСписка.СписокВыбора.Очистить();
	
	// Запрос к базе
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Наименование КАК ФИО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ФИО";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Добавляем в коллекцию СписокВыбора элемента формы
		ПолеСписка.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.ФИО);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСотрудниковДляВыбора()
	
	Список = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
